/*

    ==C01
    Досьє - Викладач
    - курси
    - календар викладача
    - години: зайняті
    - фінансові ...
    - дедлайни

    --> Досьє буде відкриватися у великій формі. У цій правій частині буде лише summary


    ==C02
    Досьє - учасник
    - курси
    - інфа про учасника / здачі
    - домашні завдання і т. д.
    - дедлайни


    ==C03
    Профайл
    - фото
    - ім'я
    - група
    - компанія
    - посада (роль)
    - сфера (галузь)
    - місто
    - День народження
    - email
    - mobile 
    - phone
    - повідомлення
    - можливість додати / видалити з друзів (підписка)
    - Соціальні контакти / профайли (facebook, twitter)
    - До яких груп в mykmbs підписаний   
    
    TODO maybe refactor 'auth.board' --> 'user.board.admin'


    ==C04
    CRUD Профайл
    - фото (завантажити, CRUD)
    - фінансові показники (для фінансового менеджера)?
    - форми додавання соціальних контактів
    - форми додавання груп з mykmbs
    

    ==C05
    Аплікаційна форма
    - фото (CRUD?)
    - ім'я
    - прізвище
    - по-батькові
    - дата народження
    - місце народження
    - громадянство
    - країна проживання
    - email
    - моб. телефон
    - роб. телефон
    - дом. телефон
    - фактична адреса
    - постійна адреса (прописка)
    - професійний досвід (опис):
        -- компанія
        -- посада
        -- період
        -- обов'язки
    - освіта:
        -- назва закладу
        -- ступінь (диплом)
        -- спеціалізація
        -- період / дата закінчення
    - рекомендації
        -- ім'я, прізвище рекоменданта
        -- компанія
        -- посада
        -- телефон


    ==C06
    Викладацький звіт (report)
    - скільки годин викладач викладав
    Доступний для фінансового директора?


    ==C07
    Список учасників навчальноі групи
    - таблиця з аватарами учасників
    - інформація про учасників (email, ім'я, ...)
    - можливість відправлення повідомлення
    - вікно пошуку учасників


    ==C08
    Перелік груп
    - таблиця з піктограмами / аватарами груп
    - інформація про групи (назва, кількість учасників)
    - можливість долучення / ... на групу


    ==C09
    Соціальна група (community)
    - назва
    - аватар
    - опис
    - кількість учасників
    - стрічка (stream)
    - налаштування групи


    ==C10
    Форма створення / редагування соціальноі групи (community CRUD)
    - назва
    - аватар (CRUD)
    - опис
    - налаштування підписок (управління учасниками/членами групи)
    - запрошення до групи


    ==C11
    Стіна
    - активність друзів і груп, до яких підписаний
    - стрім


    ==C12
    Список учасників мережі
    ---- coupled with C07
    - таблиця з аватарами учасників
    - інформація про учасників (email, ім'я, ...)
    - можливість відправлення повідомлення
    - вікно пошуку учасників (форми <пошуку>)
    ----
    - можливість підписати / додати друзів (~ стіна?)


    ==C14
    Вікно повідомлень, сповіщень
    (архів + створення нового)
    - перелік повідомлень 
    - перелік сповіщень (форма)
    - архів сповіщень


    ==C15
    Вікно нагадування
    - дедлайни
    - сповіщення
    - спеціальні повідомлення


    ==C16 
    CRUD вікна нагадування
    - поле дедлайнів
    - сповіщення
    - створення спеціального повідомлення
    - вибір учасників


    ==C18
    Фінансова форма


    ==C19
    Календар
    - рік
    - місяць
    - тиждень
    - день
    - модуль


    ==C20
    CRUD Події в календарі (форма створення / редагування події календаря)
    - назва події
    - дати / час початку і кінця
    - можливість відзначити цілий день
    - вибір календаря (колір, назва)
    - коментар / опис


    ==C21
    CRUD календаря


    ==C24
    Вікно перегляду матеріалу в курсі
    (матеріал + "чат")
    - перегляд різних типів файлів (відео, jpg, pdf etc.)
    - чат/комунікація, що стосується саме цього курсу / групи
    - можливість переходу а інші мтеріали (навігація як в Udemy)
    - <нотатки>?
    - можливість завантаження матеріалів?


    ==C25
    Форма створення матеріалів
    - назва матеріалу(ів)
    - викладач
    - курс
    - код кусу
    - модуль (топік)    
    - тип матеріалу
    - група


    ==C26
    Робоче місце адміна
    - список юзерів
    - report за учасниками
    - report за викладачами
    - фінансовий звіт студента?
    - фінансовий звіт професора
    - список курсів
    - список груп


    ==C27
    Робоче місце MBA директора
    - поле дедлайнів / боргів з усіх курсів / програм, викладачі / студенти
    - фінансові борги по групах / учасниках
    - список програм/груп, їх курсів


    ==C28
    Робоче місце фінансового менеджера
    - фінансові богри по всіх групах / учасниках


    ==C29
    Робоче місце менеджера
    - панель дедлайнів (студенти)
    - панель дедлайнів (викладачі)
    - список груп
    - список курсів
    - фінансові дедлайни


    ==C31
    Робоче місце викладача
    - список курсів / програм
    - список дедлайнів
    - останні сповіщення від студентів / менеджерів (у рупор)
    - повідомлення
    - можливість створити курс


    ==C33
    Список (вікно) дедлайнів викладача (connected with C27,C29)
    - курси
    - групи
    - завдання
    - дедлайни


    ==C34
    Список (вікно) дедлайнів учасників / викладачів - фінансовий? (connected with C28)
    - список усіх заборгованостей (студент) (курси, домашні роботи)
    - список усіх заборгованостей (викладач)
    - фінансові заборгованості


    ==С35
    Курс
    - інформація про курс
    - список матеріалів (по темах, модулях)
    - таблиця дедлайнів 
    - таблиця оцінок (табель)
    - завдання
    - лінія прогресу


    ==С36
    Syllabus
    - пояснення (інформація про курс)
    - список викладачів курсу, можливість перейти на їх профайли / написати повідомлення
    - розподіл балів
    - теми курсу / силабус (окремим файлом)


    ==C37
    Форма CRUD курсу
    - назва курсу
    - інформація про курс
    - навчальна група / програма
    - викладач(і)
    - кількість домашніх завдань / оцінювання
    - кількість модулів
    - кількість годин курсу


    ==C38
    Завдання (вікно)
    - назва завдання
    - поле завдання (опис)
    - кнопка підвантаження файлу(ів)
    - оцінка (якщо завдання зроблено?)
    - коментар(і) викладача
    - чат
    - дедлайн
    - історія підвантажень


    ==C39
    Форма CRUD завдання
    - назва завдання
    - коди?
    - тип?
    - поле завдання (опис)
    - час виконання 
        -- початок, кінець --- (учасник)
        -- початок, кінець --- (викладач)
    - підключення до нагадування / сповіщення
    - градація оцінки?


    ==C40
    Таблиця завдань / дедлайнів
    - завданя за курс + курси?
    - дедлайни із завданнь за курс/курси
    - оцінка за завдання / коментар


    ==C41
    Список курсів
    - перелік курсів (таблиця?)
    - викладач
    - програма (навчальна група?)
    - менеджер
    - кількість студентів
    - прогрес курс (maybe postponed?)


    ==C43
    Робоче місце учасника
    - список курсів
    - спиок дедлайнів
    - список <учасників?> <групи?>


    ==С44
    Робоче місце випускника
    - followers
    - стіна
    - новини груп
    - (доступ до пройдених раніше курсів ...)


    ==С45
    Фінансовий звіт


    ==C46
    Вигляд навчальної групи (connected with С09)


    ==C47
    CRUD навчальної групи (connected with С10)
    - створення / налаштування


    ==C52
    Модуль
    - список матеріалів за модулями з примітками на курси
    - Завдання
    - Таблиця дедлайнів
    - Перехід на курс


    ==С53
    Форма CRUD модуля
        
========================================================================
    ==C13
    Чат
    - стрім повідомлень за друзями
    - кнопки створення повідомлення, прикріплення файлу
    - архів
    === postponed because will probably be available in LINQ


    ==С23
    Бібліотека (можна відкласти трохи)
    - перелік усіх файлів / матеріалів
    - пошук файлів за <категоріями> / <критерієм>
    - CRUD файлів


    ==C30
    Робоче місце (стартова сторінка) гостьового менеджера (?) (можна точно відкласти)
    - список груп
    - список 

    ==C32
    Робоче місце викладача (дублювання?)
    - список курсів
    - повідомлення


    ==С42
    Табель за всі курси
    - оцінка за курси (всі)
    - можливість роздрукувати (PDF)
    - ~ транскрипт?
    - станд проходження курсу (час)
    
    
    ==С48
    Транскрипт (in English?) (напевно можна відкласти)
    (Назва університету, ім'я / прізвище...)
    - Program
    - Name (of user?)
    - Date (of graduation?)
    - Class (rank)
    - Average
    - Course name
        -- Professor
        -- Total score
        -- final
    - Master Project (grade)


    ==C49
    Форма CRUD транскрипта


    ==C50
    Табель успішності  (відкласти) 
    (оцінки / дедлайни за курси)
    - оцінки / дедлайни по учасникам
    - <вибір> за учасником
    (далі)
    - вибір за групами
    -  вибір за програмами


    ==C51
    Репорт по табелю успішності (відкласти?)
       ???



*/

