/* 
    ==C05
    Аплікаційна форма
    - фото (CRUD?)
    - ім'я
    - прізвище
    - по-батькові
    - дата народження
    - місце народження
    - громадянство
    - країна проживання
    - email
    - моб. телефон
    - роб. телефон
    - дом. телефон
    - фактична адреса
    - постійна адреса (прописка)
    - професійний досвід (опис):
        -- компанія
        -- посада
        -- період
        -- обов'язки
    - освіта:
        -- назва закладу
        -- ступінь (диплом)
        -- спеціалізація
        -- період / дата закінчення
    - рекомендації
        -- ім'я, прізвище рекоменданта
        -- компанія
        -- посада
        -- телефон

 */


